app/controllers/courses_controller.rb

INSERT INTO "courses" ("coursename", "string", "teacher", "studentnumber", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    @course = Course.new(course_params)

    respond_to do |format|
      if @course.save

UPDATE "courses" SET "string" = ?, "updated_at" = ? WHERE "courses"."id" = ?  [["string", "c++ is a  very useful "], ["updated_at", "2017-11-11 09:14:48.963639"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @course.update(course_params)